import pytest

from ..trie_prefix import TriePrefix


@pytest.fixture
def trie():
    words = [
        "пельмени",
        "пельмени уральские",
        "пельмешки",
        "картофель",
        "картошка фри",
        "кофе",
        "кофеин",
        "кофе эспрессо с молоком",
        "кофе латте",
        "кофе американо",
    ]
    return TriePrefix(words)


class TestTriePrefix:
    @pytest.mark.parametrize(
        "prefix, expected",
        [
            ("п", {"пельмени", "пельмени уральские", "пельмешки"}),
            ("карто", {"картофель", "картошка фри"}),
            (
                    "кофе",
                    {
                        "кофе",
                        "кофеин",
                        "кофе эспрессо с молоком",
                        "кофе латте",
                        "кофе американо",
                    },
            ),
            ("пельмени", {"пельмени", "пельмени уральские"}),
            ("картошка", {"картошка фри"}),
            ("кофе эспрессо", {"кофе эспрессо с молоком"}),
            ("", set()),
            ("пельмешки", {"пельмешки"}),
            ("кофе эспрессо с молоком", {"кофе эспрессо с молоком"}),
        ],
    )
    def test_search(self, trie, prefix, expected):
        """
        Обворачиваем вывод в set, чтобы не было проблем с порядком,
        так как в тестах порядок не важен
        """
        assert set(trie.search(prefix)) == expected

    @pytest.mark.parametrize(
        "word, prefix, expected",
        [
            (
                    "кофе",
                    "ко",
                    {"кофеин", "кофе эспрессо с молоком", "кофе латте", "кофе американо"},
            ),
            (
                    "кофеин",
                    "кофе",
                    {"кофе", "кофе эспрессо с молоком", "кофе латте", "кофе американо"},
            ),
            (
                    "кофе латте",
                    "кофе",
                    {"кофе", "кофе эспрессо с молоком", "кофеин", "кофе американо"},
            ),
            ("пельмени", "пельм", {"пельмешки", "пельмени уральские"}),
        ],
    )
    def test_delete_and_search(self, trie, word, prefix, expected):
        trie.delete(word)
        assert set(trie.search(prefix)) == expected
