def show_start():
    return (f'=====================\n'
            f'  Добро пожаловать!  \n'
            f'   Игра "Виселица"   \n'
            f'=====================\n')

def __print_menu():
    return (f'=====================\n'
            f'[1] Начать игру\n'
            f'[2] Правила игры\n'
            f'[3] Выход\n'
            f'=====================\n')

def __show_rules():
    return (f'======================\n'
            f'Цель: Угадать слово по буквам.\n'
            f'Ход игры:\n'
            f'1. Ведущий загадывает слово и программа рисует чёрточки.\n'
            f'2. Игроки называют буквы.\n'
            f'3. Если буква есть — она открывается.\n'
            f'4. Если нет — рисуется часть виселицы.\n'
            f'5. Проигрыш: когда виселица нарисована полностью.\n'
            f'6. Победа: когда слово угадано.\n'
            f'7. После победы или проигрыша игра заканчивается.\n'
            f'======================\n')

def show_menu():
    while True:
        print(__print_menu())
        option = input('[!] Выберите пункт меню: ').strip()

        match option:
            case '1':
                break
            case '2':
                print(__show_rules())
            case '3':
                exit(0)

def step_1():
    return (f' |          \n'
            f' |          \n'
            f' |          \n'
            f' |          \n'
            f' |          \n')

def step_2():
    return (f' |          \n'
            f' |          \n'
            f' |          \n'
            f' |          \n'
            f' |          \n'
            f'––––––      \n')

def step_3():
    return (f' –––––––––––\n'
            f' |          \n'
            f' |          \n'
            f' |          \n'
            f' |          \n'
            f' |          \n'
            f'––––––      \n')

def step_4():
    return (f' ––/––––––––\n'
            f' |/         \n'
            f' |          \n'
            f' |          \n'
            f' |          \n'
            f' |          \n'
            f'––––––      \n')

def step_5():
    return (f' ––/––––––––\n'
            f' |/      |  \n'
            f' |          \n'
            f' |          \n'
            f' |          \n'
            f' |          \n'
            f'––––––      \n')

def step_6():
    return (f' ––/––––––––\n'
            f' |/      |  \n'
            f' |       o  \n'
            f' |          \n'
            f' |          \n'
            f' |          \n'
            f'––––––      \n')

def step_7():
    return (f' ––/––––––––\n'
            f' |/      |  \n'
            f' |       o  \n'
            f' |       0  \n'
            f' |          \n'
            f' |          \n'
            f'––––––      \n')

def step_8():
    return (f' ––/––––––––\n'
            f' |/      |  \n'
            f' |       o  \n'
            f' |       0\\\n'
            f' |          \n'
            f' |          \n'
            f'––––––      \n')

def step_9():
    return (f' ––/––––––––\n'
            f' |/      |  \n'
            f' |       o  \n'
            f' |      /0\\\n'
            f' |          \n'
            f' |          \n'
            f'––––––      \n')

def step_10():
    return (f' ––/––––––––\n'
            f' |/      |  \n'
            f' |       o  \n'
            f' |      /0\\\n'
            f' |      /   \n'
            f' |          \n'
            f'––––––      \n')

def step_11():
    return (f' ––/––––––––\n'
            f' |/      |  \n'
            f' |       o  \n'
            f' |      /0\\\n'
            f' |      / \\\n'
            f' |          \n'
            f'––––––      \n')
